Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <module name="QSPI" id="04708" name2="com_qspi_u2008_v2" version="A">
          <instance name="QSPI">
            <register-group name="QSPI" name-in-module="QSPI" address-space="base" offset="0x42000000"/>
            <signals>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="64"/>
              <param name="DMAC_ID_RX" value="51"/>
              <param name="DMAC_ID_TX" value="52"/>
            </parameters>
          </instance>
        </module>
        <module name="RAMECC" id="04713" name2="ram_ramecc_u2268_v2" version="A">
          <instance name="RAMECC">
            <register-group name="RAMECC" name-in-module="RAMECC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="RCON" id="03100" name2="clk_cru_upb_v3" version="A">
          <instance name="RCON">
            <register-group name="RCON" name-in-module="RCON" address-space="base" offset="0x44000A00"/>
          </instance>
        </module>
        <module name="ROT" id="04599" name2="sec_root_of_trust_v1" version="Rev A.1">
          <instance name="ROT">
            <register-group name="ROT" name-in-module="ROT" address-space="base" offset="0x44002C00"/>
            <parameters>
              <param name="ROM_SIZE" value="64"/>
              <param name="NUM_FUSE_BLKS" value="3" caption="CAL bits and die info a part of the NVR region"/>
              <param name="CAL_NUM" value="0"/>
              <param name="SYMMETRIC_SECURE_BOOT" value="0" caption="Secure boot using ECCDSA authentication"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" name2="tmr_rtc_u2250_v4" version="A">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x42010000"/>
            <signals>
              <signal group="IN" index="0" function="RTCC" pad="PA3"/>
              <signal group="OUT" function="RTCC" pad="PA4"/>
              <signal group="IN0_ALT" function="RTCC" pad="PA9"/>
              <signal group="OUT_ALT" function="RTCC" pad="PA10"/>
            </signals>
            <parameters>
              <param name="CHIP_RTC_PADDR_MSB" value="9"/>
              <param name="CHIP_RTC_NUM_OF_ALARMS" value="2"/>
              <param name="CHIP_RTC_NUM_OF_BKREGS" value="1"/>
              <param name="CHIP_RTC_NUM_OF_COMP16" value="4"/>
              <param name="CHIP_RTC_NUM_OF_TAMPERS" value="4"/>
              <param name="DMAC_ID_TIMESTAMP" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="04707" name2="com_sercom_u2201_v7" version="A">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PA5"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PA6"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PB9"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PA4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="GCLK_ID_CORE" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PA7"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PA8"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PA9"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PA10"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="GCLK_ID_CORE" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SILEX" id="00585" name2="barco_silex_ba457" version="1.0.0">
          <instance name="SILEX">
            <register-group name="SILEX" name-in-module="SILEX" address-space="base" offset="0x43000000"/>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TC" id="04705" name2="tmr_tc_u2249_v5" version="A">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
              <param name="DMAC_ID_OVF" value="27"/>
              <param name="DMAC_ID_MC0" value="28"/>
              <param name="DMAC_ID_MC1" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="24"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
              <param name="DMAC_ID_OVF" value="30"/>
              <param name="DMAC_ID_MC0" value="31"/>
              <param name="DMAC_ID_MC1" value="32"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="25"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x40001C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
              <param name="DMAC_ID_OVF" value="33"/>
              <param name="DMAC_ID_MC0" value="34"/>
              <param name="DMAC_ID_MC1" value="35"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="26"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
              <param name="DMAC_ID_OVF" value="36"/>
              <param name="DMAC_ID_MC0" value="37"/>
              <param name="DMAC_ID_MC1" value="38"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="26"/>
            </parameters>
          </instance>
