Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <register name="PK_POINTERS" offset="0x2000" rw="RW" size="4" initval="0x00000000" caption="Pointers register.">
          <bitfield name="OPPTRA" caption="When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF)." mask="0xF"/>
          <bitfield name="OPPTRB" caption="When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF)." mask="0xF00"/>
          <bitfield name="OPPTRC" caption="When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory." mask="0xF0000"/>
          <bitfield name="OPPTRN" caption="When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF)." mask="0xF000000"/>
        </register>
        <register name="PK_COMMAND" offset="0x2004" rw="RW" size="4" initval="0x0000000F" caption="Command register.">
          <bitfield name="OPEADDR" caption="This field defines the operation to be performed. See documentation for more details." mask="0x7F"/>
          <bitfield name="FIELDF" caption="'0': Field is GF(p) '1': Field is GF(2**m)" mask="0x80"/>
          <bitfield name="OPBYTESM1" caption="This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -&gt; ECC on curve K-163 - 0x01F -&gt; ECC on curve P-256 - 0x02F -&gt; ECC on curve P-384 - 0x033 -&gt; ECC on curve K-409 - 0x041 -&gt; ECC on curve P-521 - 0x07F -&gt; 1024-bit RSA - 0x09F -&gt; 1280-bit RSA - 0x1FF -&gt; 4096-bit RSA - 0x3FF -&gt; 8192-bit RSA" mask="0x3FF00"/>
          <bitfield name="RANDMOD" caption="Enable randomization of modulus (counter-measure)." mask="0x80000"/>
          <bitfield name="SELCURVE" caption="Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included." mask="0x700000"/>
          <bitfield name="RANDKE" caption="Enable randomization of exponent/scalar (counter-measure)." mask="0x1000000"/>
          <bitfield name="RANDPROJ" caption="Enable randomization of projective coordinates (counter-measure)." mask="0x2000000"/>
          <bitfield name="EDWARDS" caption="Enable Edwards curve (see operation description)." mask="0x4000000"/>
          <bitfield name="SWAPBYTES" caption="Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory." mask="0x10000000"/>
          <bitfield name="FLAGA" caption="See operation description." mask="0x20000000"/>
          <bitfield name="FLAGB" caption="See operation description." mask="0x40000000"/>
          <bitfield name="CALCR2" caption="This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N" mask="0x80000000"/>
        </register>
        <register name="PK_CONTROL" offset="0x2008" rw="W" size="4" initval="0x00000000" caption="Command register.">
          <bitfield name="START" caption="Writing a '1' starts the processing." mask="0x1"/>
          <bitfield name="CLEARIRQ" caption="Writing a '1' clears the IRQ output." mask="0x2"/>
        </register>
        <register name="PK_STATUS" offset="0x200C" rw="R" size="4" initval="0x00000000" caption="Status register.">
          <bitfield name="ERRORFLAGS" caption="These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details." mask="0xFFF0"/>
          <bitfield name="PK_BUSY" caption="This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished." mask="0x10000"/>
          <bitfield name="INTRPTSTATUS" caption="This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register." mask="0x20000"/>
          <bitfield name="FAILPTR" caption="These bits indicate which data location generated the error flag. They are not available for all error flags." mask="0x1F000000"/>
        </register>
        <register name="PK_TIMER" offset="0x2014" rw="RW" size="4" initval="0x00000000" caption="Timer register.">
          <bitfield name="TIMER" caption="Number of core clock cycles." mask="0xFFFFFFFF"/>
        </register>
        <register name="PK_HWCONFIG" offset="0x2018" rw="R" size="4" initval="0x00000000" caption="Hardware configuration register.">
          <bitfield name="MAXOPSIZE" caption="Maximum operand size (number of bytes)." mask="0xFFF"/>
          <bitfield name="NBMULT" caption="Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers" mask="0xF000"/>
          <bitfield name="PRIMEFIELD" caption="Support prime field." mask="0x10000"/>
          <bitfield name="BINARYFIELD" caption="Support binary field." mask="0x20000"/>
          <bitfield name="P256" caption="Support ECC P256 acceleration." mask="0x100000"/>
          <bitfield name="P384" caption="Support ECC P384 acceleration." mask="0x200000"/>
          <bitfield name="P521" caption="Support ECC P521 acceleration." mask="0x400000"/>
          <bitfield name="P192" caption="Support ECC P192 acceleration." mask="0x800000"/>
          <bitfield name="X25519" caption="Support Curve25519/Ed25519 acceleration." mask="0x1000000"/>
          <bitfield name="AHBMASTER" caption="'0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE." mask="0x2000000"/>
          <bitfield name="DISABLESMX" caption="State of DisableSMx input (high when SM2/SM9 operations are disabled)." mask="0x20000000"/>
          <bitfield name="DISABLECLRMEM" caption="State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled)." mask="0x40000000"/>
          <bitfield name="DISABLECM" caption="State of DisableCM input (high when counter-measures are disabled)." mask="0x80000000"/>
        </register>
        <register name="PK_OPSIZE" offset="0x201C" rw="RW" size="4" initval="0x00001000" caption="Operand size register.">
          <bitfield name="OPSIZE" caption="Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master" mask="0x1FFF"/>
        </register>
