Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <register name="CFGPGQOS" offset="0x50" rw="RW" size="4" access-size="4" initval="0xe044004c" caption="">
          <bitfield name="CPUPG" caption="CPU (Code) Permission Group" mask="0x3"/>
          <bitfield name="CPUQOS" caption="CPU I/D and System Bus QOS Control" mask="0xc"/>
          <bitfield name="DMAPG" caption="DMA (Rd/Wr) Permission Group" mask="0x300"/>
          <bitfield name="DGISPIPG" caption="ADC Controller Permission Group" mask="0x30000"/>
          <bitfield name="DGISPIQOS" caption="ADC Controller QOS Control" mask="0xc0000"/>
          <bitfield name="CRYPTOPG" caption="Crypto Permission Group" mask="0x300000"/>
          <bitfield name="CRYPTOQOS" caption="Crypto QOS Control" mask="0xc00000"/>
          <bitfield name="DSUPG" caption="DSU Permission Group" mask="0x3000000"/>
          <bitfield name="FCQOS" caption="FC Controller QOS Control" mask="0x30000000"/>
          <bitfield name="WISIBQOS" caption="Wireless SIB QOS Control" mask="0xc0000000"/>
        </register>
        <register name="CFGPCLKGEN1" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EICCSEL" caption="EIC Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EICCD" caption="EIC Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="FREQMRCSEL" caption="FREQMRC Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="FREQMRCD" caption="FREQMRC Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="FREQMMCSEL" caption="FREQMMC Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="FREQMMCD" caption="FREQMMC Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM01CSEL" caption="SERCOM0/1 Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM01CD" caption="SERCOM0/1 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="TCC12CSEL" caption="TCC1/2 Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC12CD" caption="TCC1/2 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="CM4TCSEL" caption="CM4T Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CM4TCD" caption="CM4T Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN2" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC1SEL" caption="EVSYSC1 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC1CD" caption="EVSYSC1 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC2SEL" caption="EVSYSC2 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC2CD" caption="EVSYSC2 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC3SEL" caption="EVSYSC3 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC3CD" caption="EVSYSC3 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC4SEL" caption="EVSYSC4 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC4CD" caption="EVSYSC4 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC5SEL" caption="EVSYSC5 Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC5CD" caption="EVSYSC5 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC6SEL" caption="EVSYSC6 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC6CD" caption="EVSYSC6 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC7SEL" caption="EVSYSC7 Peripheral Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC7CD" caption="EVSYSC7 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC8SEL" caption="EVSYSC8 Peripheral Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC8CD" caption="EVSYSC8 Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN3" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC9SEL" caption="EVSYSC9 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC9CD" caption="EVSYSC9 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC10SEL" caption="EVSYSC10 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC10CD" caption="EVSYSC10 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC11SEL" caption="EVSYSC11 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC11CD" caption="EVSYSC11 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC12SEL" caption="EVSYSC12 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC12CD" caption="EVSYSC12 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="ACCSEL" caption="AC Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="ACCD" caption="AC Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC0CSEL" caption="TCC0 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC0CD" caption="TCC0 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN4" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0CSEL" caption="TC0 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="TC0CD" caption="TC0 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="TC1CSEL" caption="TC1 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="TC1CD" caption="TC1 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="TC23CSEL" caption="TC23CSEL Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="TC23CD" caption="TC23CD Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="TC54CSEL" caption="TC54CSEL Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="TC54CD" caption="TC54CD Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="TC67CSEL" caption="TC67CSEL Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="TC67CD" caption="TC67CD Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
        </register>
        <register name="USER_ID" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="USER_ID" caption="User unique ID, readable using the SWD USER_ID instruction" mask="0xffff"/>
        </register>
        <register name="SYSKEY" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SYSKEY" caption="System Key" mask="0xffffffff"/>
        </register>
        <register name="PMD1" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ZBMD" caption="ZigBee Module Disable" mask="0x1"/>
          <bitfield name="BTMD" caption="Bluetooth Module Disable" mask="0x2"/>
          <bitfield name="MPAMD" caption="RF MPA Module Disable" mask="0x4"/>
          <bitfield name="LPAMD" caption="RF LPA Module Disable" mask="0x8"/>
          <bitfield name="PLVDMD" caption="PLVD Module Disable" mask="0x10"/>
          <bitfield name="ACMD" caption="AC Module Disable" mask="0x40"/>
          <bitfield name="ADCMD" caption="ADC Controller Module Disable" mask="0x80"/>
          <bitfield name="ADCSARMD" caption="Shared ADC SAR Core Module Disable" mask="0x100"/>
          <bitfield name="CVDMD" caption="Shared ADC SAR Core Module Disable" mask="0x200"/>
          <bitfield name="RTCCMD" caption="RTCC Module Disable" mask="0x10000"/>
          <bitfield name="DGISPIMD" caption="DGI SPI Module Disable" mask="0x800000"/>
          <bitfield name="QSPIMD" caption="SQI Module Disable" mask="0x20000000"/>
        </register>
        <register name="PMD2" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFO5MD" caption="Reference (Clock) Out 5 Module Disable" mask="0x1000000"/>
          <bitfield name="REFO6MD" caption="Reference (Clock) Out 6 Module Disable" mask="0x2000000"/>
          <bitfield name="REFO1MD" caption="Reference (Clock) Out 1 Module Disable" mask="0x10000000"/>
          <bitfield name="REFO2MD" caption="Reference (Clock) Out 2 Module Disable" mask="0x20000000"/>
          <bitfield name="REFO3MD" caption="Reference (Clock) Out 3 Module Disable" mask="0x40000000"/>
          <bitfield name="REFO4MD" caption="Reference (Clock) Out 4 Module Disable" mask="0x80000000"/>
        </register>
        <register name="PMD3" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SER0MD" caption="SERCOM0 Module Disable" mask="0x1"/>
          <bitfield name="SER1MD" caption="SERCOM1 Module Disable" mask="0x2"/>
          <bitfield name="DACMD" caption="DAC Module Disable" mask="0x8"/>
          <bitfield name="TC0MD" caption="TC0 Module Disable" mask="0x10"/>
          <bitfield name="TC1MD" caption="TC1 Module Disable" mask="0x20"/>
          <bitfield name="TC2MD" caption="TC2 Module Disable" mask="0x40"/>
          <bitfield name="TC3MD" caption="TC3 Module Disable" mask="0x80"/>
          <bitfield name="TC4MD" caption="TC4 Module Disable" mask="0x100"/>
          <bitfield name="TC5MD" caption="TC5 Module Disable" mask="0x200"/>
          <bitfield name="TC6MD" caption="TC6 Module Disable" mask="0x400"/>
          <bitfield name="TC7MD" caption="TC7 Module Disable" mask="0x800"/>
          <bitfield name="TCC0MD" caption="TCC0 Module Disable" mask="0x1000"/>
          <bitfield name="TCC1MD" caption="TCC1 Module Disable" mask="0x2000"/>
          <bitfield name="TCC2MD" caption="TCC2 Module Disable" mask="0x4000"/>
        </register>
        <register name="MISCSTAT" offset="0x100" rw="RW" size="4" access-size="4" initval="0x01000081" caption="">
          <bitfield name="CLDORDY" caption="CLDO Ready" mask="0x200"/>
        </register>
        <register name="ID" offset="0x140" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device ID"/>
        <register name="BCFG0" offset="0x200" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PCSCMODE" caption="PCHE Single cache Mode" mask="0x2"/>
          <bitfield name="CP" caption="Boot Code Protect" mask="0x10000000"/>
          <bitfield name="SIGN" caption="Flash SIGN" mask="0x20000000"/>
          <bitfield name="BINFOVALID0" caption="First 256-bit BCFG information Valid" mask="0x80000000"/>
        </register>
        <register name="CFGCON0CLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON0SET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON0INV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
