Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <register name="PMUSEQ1" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ2" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ3" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ4" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUCFG" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="BUCK_SW_DELAY" caption="" mask="0x7f"/>
          <bitfield name="MLDO_SW_DELAY" caption="" mask="0x3f00"/>
          <bitfield name="MLDOEXT_l" caption="" mask="0xc000"/>
          <bitfield name="BUCK_CP_L" caption="" mask="0xf0000"/>
          <bitfield name="BUCK_CP_H" caption="" mask="0xf00000"/>
          <bitfield name="ADC_CP_L" caption="" mask="0xf000000"/>
          <bitfield name="ADC_CP_H" caption="" mask="0xf0000000"/>
        </register>
        <register name="PMU_VBCCMD" offset="0x48" rw="RW" size="4" access-size="4" initval="0x10000000" caption="">
          <bitfield name="VBCADDR" caption="" mask="0xffff"/>
          <bitfield name="VBCRDY" caption="" mask="0x10000000"/>
          <bitfield name="CMD" caption="" mask="0x40000000"/>
        </register>
        <register name="PMU_VBCWDATA" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCWDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="PMU_VBCRDATA" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCRDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="WCMCFG" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WCM1CFG" caption="" mask="0x7"/>
          <bitfield name="WCM2CFG" caption="" mask="0x70"/>
        </register>
        <register name="PMUIENB" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORIEN" caption="" mask="0x1"/>
          <bitfield name="BUCKBORIEN" caption="" mask="0x2"/>
          <bitfield name="SCMPIEN" caption="" mask="0x4"/>
          <bitfield name="WCMIAIEN" caption="" mask="0x8"/>
          <bitfield name="VBCIAIEN" caption="" mask="0x10"/>
        </register>
        <register name="PMUISTAT" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORINT" caption="" mask="0x1"/>
          <bitfield name="BUCKBORINT" caption="" mask="0x2"/>
          <bitfield name="SCMPINT" caption="" mask="0x4"/>
          <bitfield name="WCMIAINT" caption="" mask="0x8"/>
          <bitfield name="VBCIAINT" caption="" mask="0x10"/>
        </register>
        <register name="WCMSIZ" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SRAM1_SIZ" caption="" mask="0x300" values="DSSIZESEL"/>
        </register>
      </register-group>
      <value-group name="DSSIZESEL">
        <value name="NO_SRAM_RETENTION" caption="FlexRAM is completely powered OFF" value="0x0"/>
        <value name="16K_SRAM" caption="16K Flex RAM available in retention" value="0x1"/>
        <value name="32K_SRAM" caption="32K Flex RAM available in retention" value="0x2"/>
        <value name="RESERVED" caption="Reserved" value="0x3"/>
      </value-group>
    </module>
    <!-- THIS IS FOR 32-PIN DEVICE ONLY -->
    <module name="PPS" id="U132" version="1.0" caption="PPS">
      <register-group name="PPS" caption="'PPS">
        <!-- Next lines are INPUT function pin mappings -->
        <register name="EXTINT0R" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT0" caption="EXTINT0" mask="0xf" values="EXTINT0_PINS"/>
        </register>
        <register name="EXTINT1R" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT1" caption="EXTINT1" mask="0xf" values="EXTINT1_PINS"/>
        </register>
        <register name="EXTINT2R" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT2" caption="EXTINT2" mask="0xf" values="EXTINT2_PINS"/>
        </register>
        <register name="EXTINT3R" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT3" caption="EXTINT3" mask="0xf" values="EXTINT3_PINS"/>
        </register>
        <register name="NMIR" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NMI" caption="NMI" mask="0xf" values="NMI_PINS"/>
        </register>
