Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <register name="RPA6G4R" offset="0x244" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G4R" caption="RPA6/G4" mask="0x1f" values="RPA6G4_PINS"/>
        </register>
        <register name="RPA7G1R" offset="0x248" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G1R" caption="RPA7/G1" mask="0x1f" values="RPA7G1_PINS"/>
        </register>
        <register name="RPA7G2R" offset="0x24c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G2R" caption="RPA7/G2" mask="0x1f" values="RPA7G2_PINS"/>
        </register>
        <register name="RPA8G2R" offset="0x250" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G2R" caption="RPA8/G2" mask="0x1f" values="RPA8G2_PINS"/>
        </register>
        <register name="RPA8G3R" offset="0x254" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G3R" caption="RPA8/G3" mask="0x1f" values="RPA8G3_PINS"/>
        </register>
        <register name="RPA8G4R" offset="0x258" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G4R" caption="RPA8/G4" mask="0x1f" values="RPA8G4_PINS"/>
        </register>
        <register name="RPA9G3R" offset="0x260" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G3R" caption="RPA9/G3" mask="0x1f" values="RPA9G3_PINS"/>
        </register>
        <register name="RPA9G4R" offset="0x264" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G4R" caption="RPA9/G4" mask="0x1f" values="RPA9G4_PINS"/>
        </register>
        <register name="RPA10G4R" offset="0x26c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G4R" caption="RPA10/G4" mask="0x1f" values="RPA10G4_PINS"/>
        </register>
        <register name="RPB4G2R" offset="0x2b0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G2R" caption="RPB4G2" mask="0x1f" values="RPB4G2_PINS"/>
        </register>
        <register name="RPB5G2R" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G2R" caption="RPB5/G2" mask="0x1f" values="RPB5G2_PINS"/>
        </register>
        <register name="RPB5G1R" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G1R" caption="RPB5/G1" mask="0x1f" values="RPB5G1_PINS"/>
        </register>
        <register name="RPB6G3R" offset="0x2bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G3R" caption="RPB6/G3" mask="0x1f" values="RPB6G3_PINS"/>
        </register>
        <register name="RPB6G1R" offset="0x2c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G1R" caption="RPB6/G1" mask="0x1f" values="RPB6G1_PINS"/>
        </register>
        <register name="RPB7G1R" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G1R" caption="RPB7/G1" mask="0x1f" values="RPB7G1_PINS"/>
        </register>
        <register name="RPB7G4R" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G4R" caption="RPB7/G4" mask="0x1f" values="RPB7G4_PINS"/>
        </register>
        <register name="RPB8G1R" offset="0x2cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G1R" caption="RPB8/G1" mask="0x1f" values="RPB8G1_PINS"/>
        </register>
        <register name="RPB8G2R" offset="0x2d0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G2R" caption="RPB8/G2" mask="0x1f" values="RPB8G2_PINS"/>
        </register>
        <register name="RPB9G1R" offset="0x2d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G1R" caption="RPB9/G1" mask="0x1f" values="RPB9G1_PINS"/>
        </register>
        <register name="RPB9G3R" offset="0x2d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G3R" caption="RPB9/G3" mask="0x1f" values="RPB9G3_PINS"/>
        </register>
      </register-group>
      <!-- INPUT pin group values -->
      <value-group name="EXTINT0_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="EXTINT1_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="EXTINT2_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
