Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
      <value-group name="EXTINT3_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="NMI_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM0P0_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM0P1_PINS" caption="Group5">
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA5" caption="RPA5" value="2"/>
        <value name="RPA6" caption="RPA6" value="3"/>
        <value name="RPA7" caption="RPA7" value="4"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB6" caption="RPB6" value="6"/>
        <value name="RPB8" caption="RPB8" value="7"/>
        <value name="RPB9" caption="RPB9" value="8"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM0P2_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM0P3_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM1P2_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM1P3_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM1P0_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="SCOM1P1_PINS" caption="Group5">
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA5" caption="RPA5" value="2"/>
        <value name="RPA6" caption="RPA6" value="3"/>
        <value name="RPA7" caption="RPA7" value="4"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB6" caption="RPB6" value="6"/>
        <value name="RPB8" caption="RPB8" value="7"/>
        <value name="RPB9" caption="RPB9" value="8"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD0_PINS" caption="Group4">
        <value name="RPA6" caption="RPA6" value="1"/>
        <value name="RPA10" caption="RPA10" value="2"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPA5" caption="RPA5" value="8"/>
        <value name="RPA9" caption="RPA9" value="9"/>
        <value name="RPB6" caption="RPB6" value="12"/>
        <value name="RPA8" caption="RPA8" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD1_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD2_PINS" caption="Group2">
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="QD3_PINS" caption="Group3">
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
