Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/atdf/WBZ350.atdf
        <register name="SUBSYS_STATUS_REG1" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG1">
          <bitfield name="pllc_ready_cnt_expire_raw" caption="pllc_ready_cnt_expire_raw" mask="0x100"/>
          <bitfield name="pll_lock_fifo_empty" caption="XTAL_ready" mask="0x80"/>
          <bitfield name="clk_mux_sel" caption="clk_mux_sel0" mask="0x60"/>
          <bitfield name="clk_lp_ready" caption="clk_lp_ready" mask="0x10"/>
          <bitfield name="PLL_locked" caption="PLL_locked" mask="0x8"/>
          <bitfield name="XTAL_ready" caption="XTAL_ready" mask="0x4"/>
          <bitfield name="pll_lock_out" caption="pll_lock_out" mask="0x2"/>
          <bitfield name="xtal_ready_out" caption="xtal_ready_out" mask="0x1"/>
        </register>
        <register name="SUBSYS_STATUS_REG2" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG2">
          <bitfield name="PART_NUM" caption="PART_NUM" mask="0xFF00"/>
          <bitfield name="VERSION_NUM" caption="VERSION_NUM" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A" caption="ZigBee MAC DOS">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="LGA30" caption="LGA30">
      <pin position="1" pad="GND"/>
      <pin position="2" pad="NMCLR"/>
      <pin position="3" pad="PA4"/>
      <pin position="4" pad="AVDD"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="PA11"/>
      <pin position="7" pad="PA12"/>
      <pin position="8" pad="GND"/>
      <pin position="9" pad="PB5"/>
      <pin position="10" pad="PA3"/>
      <pin position="11" pad="PB4"/>
      <pin position="12" pad="PB6"/>
      <pin position="13" pad="PB8"/>
      <pin position="14" pad="PB9"/>
      <pin position="15" pad="PB7"/>
      <pin position="16" pad="VDD"/>
      <pin position="17" pad="VDD"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="PA5"/>
      <pin position="20" pad="PA6"/>
      <pin position="21" pad="GND"/>
      <pin position="22" pad="PA9"/>
      <pin position="23" pad="PA10"/>
      <pin position="24" pad="PA8"/>
      <pin position="25" pad="PA7"/>
      <pin position="26" pad="NC"/>
      <pin position="27" pad="GND"/>
      <pin position="28" pad="NC"/>
      <pin position="29" pad="NC"/>
      <pin position="30" pad="NC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
